config/doom/config.org
#+TITLE: Doom Emacs Configuration
#+AUTHOR: 
#+DATE: 
#+DESCRIPTION: Personal configuration for Doom Emacs.
#+STARTUP: overview
#+PROPERTY: header-args :results silent
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup

* Overview

** What is this?

This is my personal [[https://en.wikipedia.org/wiki/Literate_programming][literate]] configuration for [[https://github.com/hlissner/doom-emacs][Doom Emacs]], mostly focused towards Org-mode and programming, written in Org-mode.

** Why is there an =;;;###autoload= on top of =defun= calls?

You can read more information on this on [[https://github.com/hlissner/doom-emacs/blob/develop/docs/getting_started.org#autoloadel-or-autoloadel][Doom's Getting Started page]]. *Note* that the
source blocks which contain these functions are tangled into a different file,
=autoload.el=.

** Symbol name prefixes

Symbol (functions, variables etc) names are prefixed with either =ch/= or =contrib/=. These
work sort of like namespaces that contain my /additions/ to Emacs. This kind of
differentiation makes it easy to discover custom additions.

Functions that I've written myself to either enhance a built-in feature or add extra
functionality, are prefixed with =ch/=.

Functions that I've basically copied from others are prefixed with =contrib/=.

* Requirements

To use this configuration, there are a couple of things that should be installed on your
system (other than the [[https://github.com/hlissner/doom-emacs#prerequisites][Doom prerequisites]]). ~doom doctor~ will catch most of them, if not
all, but I'll mention them anyway:

+ =Source Code Pro=, =Fira Code= and =Hack= fonts.
+ A LaTeX compiler for rendering math.
+ ~sqlite3~ for org-roam.
+ ~jsbeautify~ for formatting JS/CSS/HTML code.
+ ~python-black~ for formatting Python code.
+ ~python-isort~ for sorting Python imports.
+ Maybe I'm forgetting something.. Will try to update!

* Package management

Doom's packaging system dictates that package management should be done in the
=$DOOMDIR/packages.el= file, using the ~package!~ macro.


#+begin_comment
*Note* that every source block with a ~(package! ...)~, ~pin!~ or ~unpin!~ call is tangled
to the =packages.el= file!
#+end_comment

First of all, let's ensure that =byte-compile= is disabled for the =packages.el= file.

#+begin_src emacs-lisp :tangle "packages.el"
;; -*- no-byte-compile: t; -*-
#+end_src

Doom pins every package to a specific commit, but there are some packages I would like to
always be updated:

#+begin_src emacs-lisp :tangle "packages.el"
(unpin! doom-modeline)
(unpin! doom-themes)
(unpin! vterm)
#+end_src

On the other hand, there are some packages I have no use for, so let's just disable them.

#+begin_src emacs-lisp :tangle "packages.el"
(package! evil-escape :disable t)
(package! evil-quick-diff :disable t)
(package! evil-traces :disable t)
(package! cuda-mode :disable t)
(package! demangle-mode :disable t)
(package! disaster :disable t)
(package! overseer :disable t)
(package! buttercup :disable t)
(package! opencl-mode :disable t)
(package! glsl-mode :disable t)
(package! company-glsl :disable t)
(package! flyspell-lazy :disable t)
#+end_src

* General configuration

Before going any further, let's enable =lexical binding= for the resulting =config.el=.
See this [[https://nullprogram.com/blog/2016/12/22/][blog post]] for more information on why =lexical binding= is used.

#+begin_src emacs-lisp
;;; config.el -*- lexical-binding: t; -*-
#+end_src

Doom comes with very sane defaults, but there are some things I would like to work a
bit differently.

** Start on fullscreen

I usually maximize the frame right after opening Emacs. Let's have that happen by default.

#+begin_src emacs-lisp
(add-to-list 'default-frame-alist '(fullscreen . maximized))
#+end_src

** Scrolling

Page scrolling should keep the point at the same visual position, rather than force it
to the top or bottom of the viewport.

#+begin_src emacs-lisp
(setq-default scroll-preserve-screen-position t
              scroll-conservatively 1
              scroll-margin 0)
#+end_src

** Theme

I switch between themes more frequently than I would like to. Some of my favorites are:
Protesilaos Stavrou's [[https://protesilaos.com/modus-themes/][modus-themes]], all the [[https://github.com/purcell/color-theme-sanityinc-tomorrow][Tomorrow themes]] from Steve Purcell, =doom-nord=,
=doom-one= and =doom-gruvbox= (also their light variants).

#+begin_src emacs-lisp :tangle "packages.el"
(package! modus-operandi-theme)
(package! modus-vivendi-theme)
(package! color-theme-sanityinc-tomorrow)
#+end_src

#+begin_src emacs-lisp
(setq doom-theme 'doom-nord)

;; Simple tweaks to modus-themes.
(cond
 ((equal doom-theme 'modus-operandi)
  (setq modus-operandi-theme-distinct-org-blocks t
        modus-operandi-theme-scale-headings nil
        modus-operandi-theme-completions 'moderate
        modus-operandi-theme-visible-fringes 'subtle))
 ((equal doom-theme 'modus-vivendi)
  (setq modus-vivendi-theme-distinct-org-blocks t
        modus-vivendi-theme-scale-headings nil
        modus-vivendi-theme-completions 'moderate
        modus-vivendi-theme-visible-fringes 'subtle)))
#+end_src

** Fonts

I'm a big fan of the =Source Code Pro=, =Fira Code= and =Hack= fonts.

#+begin_src emacs-lisp
(setq doom-font (font-spec :family "Hack" :size 15)
      doom-big-font (font-spec :family "Hack" :size 18)
      doom-variable-pitch-font (font-spec :family "Hack" :size 17))
(setq doom-unicode-font (font-spec :name "DejaVu Sans Mono"))
#+end_src

** Modeline

I usually use the "light" variant of the modeline which is included in Doom, instead of
~doom-modeline~. I would like it to be a bit smaller, and stop showing
information about buffer encoding.

#+begin_src emacs-lisp
(when (featurep! :ui modeline +light)
  (setq +modeline-height 15
        +modeline-encoding nil))
#+end_src

Let's also make the same changes to =doom-modeline=, for the times I do use it.
Moreover, there is an issue which causes the right side of the modeline to cut off.
According to Doom's documentation, to fix it we can either:
1. Tweak ~all-the-icons-scale-factor~,
2. Add some padding to the modeline definition,
3. Use another font for the modeline, with a lower =:height=.


I choose the second option.

#+begin_src emacs-lisp
(after! doom-modeline
  (setq doom-modeline-height 15
        doom-modeline-buffer-encoding nil)

  (doom-modeline-def-modeline 'main
    '(bar matches buffer-info remote-host buffer-position parrot selection-info)
    '(misc-info minor-modes checker input-method buffer-encoding major-mode process vcs "  ")))
#+end_src

I also like having the time displayed in the modeline, but not the load average.

#+begin_src emacs-lisp
(after! time
  (setq display-time-default-load-average nil)
  (display-time-mode 1))
#+end_src

** Dashboard

The Dooom ASCII art that is shown in the dashboard looks very nice, but I think I prefer
the Emacs logo.

#+begin_src emacs-lisp
(setq fancy-splash-image (concat doom-private-dir "splash.png"))
#+end_src

Also, I kinda know all the shortcuts, so there is no need for the shortcut menu.

#+begin_src emacs-lisp
(remove-hook '+doom-dashboard-functions #'doom-dashboard-widget-shortmenu)
#+end_src

** Line numbers

Don't show line numbers. I don't really get any useful information by knowing on which
line I'm currently on, and the impact on performance is quite noticeable.

#+begin_src emacs-lisp
(setq display-line-numbers-type nil)
#+end_src

** Frame title

Finally, I would like to use the buffer's name as the frame title.

#+begin_src emacs-lisp
(setq frame-title-format '("%b"))
#+end_src

** Enable disabled functions

Doom by default disables the ~narrow-to-region~ function. I find it quite useful.

#+begin_src emacs-lisp
(put 'narrow-to-region 'disabled nil)
#+end_src

** Evil-mode

A couple of things I would to change from the default configuration.

+ When exiting /insert mode/, the cursor moves one position backwards. Setting
  ~evil-move-cursor-back~ to ~nil~ "fixes" that.

+ When I split a window, I usually want to move to that new split.

+ While in /insert mode/, all changes are considered one big blog. Be more granular.

+ Use Emacs keybindings in ~dired~.

#+begin_src emacs-lisp
(after! evil
  (setq
   evil-move-cursor-back nil
   evil-split-window-below t
   evil-vsplit-window-right t)
  (add-to-list 'evil-emacs-state-modes 'dired-mode))
#+end_src

Having to press 3 buttons (=C-w h=, =C-w l= etc.) to move between windows is a bit much, so
let's create some shorter keybindings, using the Meta key (=Alt=).

#+begin_src emacs-lisp
(map! (:after evil
       "M-h" 'nil
       "M-j" 'nil
       "M-k" 'nil
       "M-l" 'nil
       "M-q" 'nil
       :enm "M-h" #'evil-window-left
       :enm "M-j" #'evil-window-down
       :enm "M-k" #'evil-window-up
       :enm "M-l" #'evil-window-right
       :enm "M-q" #'evil-quit))
#+end_src

Use ~vim-surround~ operator keys for ~evil-surround~'s change & delete functionality.

#+begin_src emacs-lisp
(map! (:after evil
       (:map evil-operator-state-map
        "r" 'evil-surround-change
        "d" 'evil-surround-delete)))
#+end_src

Finally, use =j/k= instead of =gj/gk= to move between visual lines.

#+begin_src emacs-lisp
(map! (:after evil
       (:map evil-normal-state-map
        "j" 'evil-next-visual-line
        "k" 'evil-previous-visual-line)))
#+end_src

* Completion and searching

** Text completion with company

#+begin_src emacs-lisp
(after! company
  (setq company-idle-delay 0.3
        company-global-modes '(not shell-mode)
        company-minimum-prefix-length 1
        company-tooltip-align-annotations t
        company-dabbrev-downcase nil
        company-tooltip-limit 10)
  (when (featurep! :completion company +childframe)
    (setq company-box-doc-delay 6
          company-box-enable-icon nil))
  ;; Make aborting less annoying.
  (add-hook 'evil-normal-state-entry-hook #'company-abort))
#+end_src

** Minibuffer completion with ivy

What I really like about Emacs, is the ability to search and narrow candidates. You don't
have to know where things are, just how to search for them.

There are many completion frameworks available, like [[https://github.com/emacs-helm/helm][helm]], [[https://github.com/raxod502/selectrum][selectrum]], [[https://github.com/abo-abo/swiper][ivy/counsel/swiper]],
the built-in ~icomplete~ etc. I currently use ~ivy~, since that's the default in Doom.

*** Ivy configuration

Here are some useful tips for working with ivy. While in a minibuffer prompt, e.g., ~M-x~:

+ You can create a /buffer/ with the selection candidates using ~C-c C-o~.

+ You can search for something and then press ~S-Space~ to "lock" this search term, and use
  it as a filter. For example, if you type =recentf= in ~M-x~ and then press ~S-Space~, the
  results will be narrowed down to only those containing the word =recentf=.

+ Pressing ~M-j~ will copy the word under the cursor to the minibuffer.

+ There are times -usually when searching for documentation- when you want to run the command
  but keep the minibuffer open. You can do that with ~C-M-m~.
  You can be even more efficient and use ~C-M-n~ or ~C-M-p~ to move to the next or previous
  command respectively and run it, all at once, without leaving the minibuffer.

+ ~C-p~ will focus the prompt instead of the selection. Especially useful when trying to
  create a file with a name similar to an existing file.


And here are all the above and some extras, presented in a more "compact" way:

| Key     | Function                | Description                                |
|---------+-------------------------+--------------------------------------------|
| C-c C-o | ivy-ocur                | Place the candidates in a buffer.          |
| C-M-m   | ivy-call                | Run command, keeping minibuffer open.      |
| M-i     | ivy-insert-current      | Insert matching selection in the prompt.   |
| M-j     | ivy-yank-word           | Copy word-at-point in the minibuffer.      |
| S-SPC   | ivy-restrict-to-matches | Filter candidates according to the prompt. |

Finally, here is my configuration. Some things to note:

+ =SPC= is set so it does *not* complete in the minibuffer.
+ ~ivy-read-action-function~ is set so ~ivy~ actions are displayed using a hydra.
  Otherwise, in cases where there are many actions, they overflow the popup.

#+begin_src emacs-lisp
(map! (:map minibuffer-local-completion-map
       "SPC" 'nil))

(after! ivy
  (setq ivy-count-format "(%d/%d) "
        ivy-display-style 'fancy
        ivy-use-selectable-prompt t
        ivy-fixed-height-minibuffer nil
        ivy-read-action-function #'ivy-hydra-read-action))
#+end_src

*** Counsel configuration

The defaults are mostly fine, except two things.

+ I would like a nicer separator when browsing the kill-ring (~counsel-yank-pop~).

+ [[https://github.com/BurntSushi/ripgrep][ripgrep]], or ~rg~ in short, is way faster than ~grep~, so let's use it for everything search-related.

#+begin_src emacs-lisp
(after! counsel
  (setq counsel-yank-pop-preselect-last t
        counsel-yank-pop-separator "\n—————————\n")
  (setq counsel-fzf-cmd "rg --files --hidden --no-ignore --smart-case --glob !.git | fzf -f \"%s\"")
  (setq counsel-grep-base-command
        "rg -M 120 --line-number --smart-case --with-filename --color never --hidden --no-heading %s")
  (setq counsel-git-cmd "rg --files"))
#+end_src

Finally, some keybindings for easier access to commonly used functions.
#+begin_src emacs-lisp
(map! (:after counsel
       (:leader
        "s R" 'counsel-rg)
       "s-f" 'counsel-find-file
       "s-F" 'find-file-other-window
       "s-d" 'counsel-dired
       "s-D" 'dired-other-window
       "s-p" 'counsel-fzf))
#+end_src

*** Swiper keybindings

Kinda odd that these don't exist by default.

#+begin_src emacs-lisp
(after! ivy
  (map! (:leader
         :desc "Search all buffers"
         "s a" 'swiper-all
         :desc "Search all buffers for thing at point"
         "s A" 'swiper-all-thing-at-point)))
#+end_src

** imenu

~imenu~ comes built-in with Emacs and offers completion-based buffer navigation. It builds
an "index" of positions and then displays the list using a completion interface (in our case,
~ivy~).

~imenu~ integrates very nicely with org-mode, making it easy to navigate around large
org-files, but there is an issue. When the content of an Org file is folded, jumping to a
heading using ~imenu~ will not unfold the heading.

Let's create a function and a hook to fix this issue.

#+begin_src emacs-lisp :tangle "autoload.el"
;;;###autoload
(defun ch/imenu-reveal-content ()
  "Reveal header content after `imenu' jump."
  (cond
   ((and (eq major-mode 'org-mode)
         (org-at-heading-p))
    (org-show-entry)
    (org-reveal t))))
#+end_src

#+begin_src emacs-lisp
(after! imenu
  (add-hook 'imenu-after-jump-hook 'ch/imenu-reveal-content))
#+end_src

