config/doom/config.org
*** imenu-list

Having a permanently visible imenu index instead of the completion can be useful at times.
[[https://github.com/bmag/imenu-list][imenu-list]] provides a nice sidebar with the contents of ~imenu~'s index.

#+begin_src emacs-lisp :tangle "packages.el" 
(package! imenu-list)
#+end_src

#+begin_src emacs-lisp
(use-package! imenu-list
  :after imenu
  :config

  (defun contrib/imenu-list-dwim (&optional arg)
    "Convenience wrapper for `imenu-list'.
Move between the current buffer and a dedicated window with the
contents of `imenu'.

The dedicated window is created if it does not exist, while it is
updated once it is focused again through this command.

With \\[universal-argument] toggle the display of the window."
    (interactive "P")
    (if arg
        (imenu-list-smart-toggle)
      (with-current-buffer
          (if (eq major-mode 'imenu-list-major-mode)
              (pop-to-buffer (other-buffer (current-buffer) t))
            (imenu-list)))))

  (map! :after imenu
        (:leader
         :desc "imenu-list-dwim"
         "s I" 'contrib/imenu-list-dwim)))
#+end_src

** isearch

The built-in ~isearch~ command is honestly top notch. Below is a "cheat-sheet" for the
~isearch~ keybindings I find most useful.

| Key bind | Description                  |
|----------+------------------------------|
| C-s C-w  | Search char or word at point |
| M-s o    | Run 'occur' on regexp        |
| M-s h r  | Highlight regexp             |
| M-s h u  | Undo the highlighting        |
| C-s M-r  | Toggle regexp search         |
| M-%      | Query replace                |
| C-M-%    | Query replace regexp         |

However, some tweaks are needed.

#+begin_src emacs-lisp
(after! isearch
  (setq search-highlight t
        search-whitespace-regexp ".*?"
        isearch-lazy-count t
        lazy-count-prefix-format nil
        lazy-count-suffix-format " (%s/%s)"
        isearch-yank-on-move 'shift
        isearch-allow-scroll 'unlimited))
#+end_src

** Search enhancements

Replacing the symbol at point is a pretty common task, but by default, it requires two
steps. Let's define a function to make this task faster.

#+begin_src emacs-lisp :tangle "autoload.el"
;;;###autoload
(defun ch/isearch-query-replace-symbol-at-point ()
  "Run `query-replace-regexp' for symbol at point."
  (interactive)
  (isearch-forward-symbol-at-point)
  (isearch-query-replace-regexp))
#+end_src

Now let's bind it to a key for easier access.

#+begin_src emacs-lisp
(map! (:after isearch
       :desc "QUery replace symbol at point"
       "M-s %" 'ch/isearch-query-replace-symbol-at-point))
#+end_src


#+begin_src emacs-lisp :tangle "autoload.el"
;;;###autoload
(defun ch/find-in-dotfiles ()
  "Open a file somewhere in ~/git/dotfiles via a fuzzy filename search."
  (interactive)
  (doom-project-find-file (expand-file-name "~/git/dotfiles/")))

;;;###autoload
(defun ch/occur-urls ()
  "Produce a list with all the URLs found in the current buffer."
  (interactive)
  (let ((urls browse-url-button-regexp))
    (occur urls "\\&")))
#+end_src

Let's also bind ~ch/find-in-dotfiles~.

#+begin_src emacs-lisp
(map! (:leader
       :desc "Find file in dotfiles"
       "f t" #'ch/find-in-dotfiles))
#+end_src

* Project navigation & management with projectile

I additionally want ~projectile~ to:

1. Not require a project in order to work.
2. Have faster indexing.
3. Not create projects in ignored directories.

#+begin_src emacs-lisp
(after! projectile

  (defun ch/projectile-ignore-project-p (project-root)
    (string-match-p "/\\.emacs\\.d/\\.local/straight/repos" project-root))

  (setq
   projectile-require-project-root 'prompt
   projectile-indexing-method 'alien
   projectile-ignored-projects '("~/" "/tmp" "~/.emacs.d/.local/straight/repos" "~/.emacs/.local/straight/build")
   projectile-ignored-project-function #'ch/projectile-ignore-project-p))
#+end_src

* File management with dired

** Base dired configuration

The defaults are pretty much fine, but there are few extra things I find quite nice:

+ Copy and delete recursively.
+ Don't permanently delete files. Instead, send them to trash.
+ Configure listing switches. (~man ls~ for more information).
+ Hide details like permissions, size etc by default.
+ Highlight the current line.

#+begin_src emacs-lisp
(after! dired
  (setq dired-recursive-deletes 'always
        dired-recursive-copies 'always
        delete-by-moving-to-trash t
        dired-listing-switches "-AGFhlv --group-directories-first --time-style=long-iso")
  (add-hook 'dired-mode-hook (lambda ()
                               (dired-hide-details-mode 1)
                               (hl-line-mode))))
#+end_src

** Extra functionality

*** dired-x

#+begin_src emacs-lisp
(after! dired-x
  (setq dired-clean-up-buffers-too t
        dired-clean-confirm-killing-deleted-buffers t
        dired-bind-info nil
        dired-bind-man nil))
#+end_src
*** dired-async

Gives ~dired~ the ability to perform actions asynchronously.

#+begin_src emacs-lisp
(after! (:and dired async)
  (dired-async-mode 1))
#+end_src
*** dired-open

~dired-open~ allows us to specify the default applications to be used for different
mime-types, when opening them from inside ~dired~.

#+begin_src emacs-lisp :tangle "packages.el"
(package! dired-open)
#+end_src


#+begin_src emacs-lisp
(use-package! dired-open
  :after (dired)
  :config
  (setq dired-open-extensions
        '(("pdf" . "evince")
          ("jpg" . "eog")
          ("png" . "eog")
          ("mkv" . "mpv")
          ("mov" . "mpv")
          ("mp3" . "mpv")
          ("mp4" . "mpv")
          ("avi" . "mpv"))))
#+end_src
*** dired-subtree

By default, ~dired~ provides a flat view of directories and has no concept of subtrees.
I really can't get used to that. ~dired-subtree~ brings subtrees to dired.

#+begin_src emacs-lisp :tangle "packages.el"
(package! dired-subtree)
#+end_src

#+begin_src emacs-lisp
(use-package! dired-subtree
  :after dired
  :config
  (setq dired-subtree-cycle-depth 4)
  (map! :map dired-mode-map
        [backtab] #'dired-subtree-cycle
        [tab] #'dired-subtree-toggle
        :n "g^" #'dired-subtree-beginning
        :n "g$" #'dired-subtree-end
        :n "gm" #'dired-subtree-mark-subtree
        :n "gu" #'dired-subtree-unmark-subtree))
#+end_src
*** dired-narrow

~dired-narrow~ allows us to search and narrow based on regex, with can be super useful
when browsing large directories.

#+begin_src emacs-lisp :tangle "packages.el"
(package! dired-narrow)
#+end_src

#+begin_src emacs-lisp
(use-package! dired-narrow
  :after dired
  :config
  (setq dired-narrow-exit-when-one-left t
        dired-narrow-enable-blinking t
        dired-narrow-blink-time 0.3)
  (map! :map dired-mode-map
        "C-c /" 'dired-narrow-regexp))
#+end_src

*** peep-dired

~peep-dired~ provides file previews

#+begin_src emacs-lisp :tangle "packages.el"
(package! peep-dired)
#+end_src

#+begin_src emacs-lisp
(use-package! peep-dired
  :after dired
  :config
  (setq peep-dired-cleanup-on-disable t
        peep-dired-cleanup-eagerly t
        peep-dired-enable-on-directories nil
        peep-dired-ignored-extensions
        '("mkv" "webm" "mp4" "mp3" "ogg" "iso"))
  (map! :map dired-mode-map
        "P" 'peep-dired))
#+end_src
*** dired-du

Check directory size, inside dired.

#+begin_src emacs-lisp :tangle "packages.el"
(package! dired-du)
#+end_src

#+begin_src emacs-lisp
(use-package! dired-du
  :after dired
  :commands dired-du-mode)
#+end_src

** Key bindings

#+begin_src emacs-lisp
(map! :after dired
      (:map dired-mode-map
       :enm "M-h" #'evil-window-left
       :enm "M-j" #'evil-window-bottom
       :enm "M-k" #'evil-window-up
       :enm "M-l" #'evil-window-right
       :enm "M-q" #'evil-quit
       "j" 'dired-next-line
       "k" 'dired-previous-line
       "h" 'dired-up-directory
       "l" 'dired-open-file)
      "s-j" 'dired-jump
      "s-J" 'dired-jump-other-window
      "M-RET" 'dired-display-file)
#+end_src
* Buffer management

** ibuffer (dired-like buffer management tool)

;; TODO: Try out ~buffler~.

#+begin_src emacs-lisp
(after! ibuffer
  (setq ibuffer-display-summary nil)
  (setq ibuffer-formats
        '((mark modified read-only locked " "
                (name 30 30 :left :elide)
                " "
                (mode 16 16 :left :elide)
                " " filename-and-process)
          (mark " "
                (name 16 -1)
                " " filename))))
#+end_src

** Buffer cleanup

Here are some functions that can be used to:

+ Kill all the buffers except the current one.
+ Kill all dired buffers.

#+begin_src emacs-lisp :tangle "autoload.el"
;;;###autoload
(defun ch/kill-other-buffers ()
  "Kill all buffers except current one."
  (interactive)
  (mapc 'kill-buffer (delq (current-buffer) (buffer-list))))

;;;###autoload
(defun ch/kill-all-dired-buffers ()
  "Kill all open dired buffers."
  (interactive)
  (mapc (lambda (buffer)
          (when (eq 'dired-mode (buffer-local-value 'major-mode buffer))
            (kill-buffer buffer)))
        (buffer-list)))
#+end_src

Let's add some keybindings for those.
#+begin_src emacs-lisp
(map! "s-k" 'ch/kill-other-buffers
      "s-K" 'ch/kill-all-dired-buffers)
#+end_src

* Window navigation and management

** Fast window navigation with ace-window

#+begin_src emacs-lisp :tangle "packages.el"
(package! ace-window)
#+end_src

#+begin_src emacs-lisp
(use-package! ace-window
  :defer t
  :config
  (setq aw-keys '(?h ?j ?k ?l ?y ?u ?i ?o ?p))
  (setq aw-scope 'frame)
  (setq aw-dispatch-always t)
  (setq aw-dispatch-alist
        '((?s aw-swap-window "Swap Windows")
          (?2 aw-split-window-vert "Split Window Vertically")
          (?3 aw-split-window-horz "Split Window Horizontally")
          (?? aw-show-dispatch-help)))
  (setq aw-minibuffer-flag t)
  (setq aw-ignore-current nil)
  (setq aw-display-mode-overlay t)
  (setq aw-background t)
  (ace-window-display-mode -1))

(map! :leader
      (:prefix ("w" . "+window")
       :desc "Ace window" "a" 'ace-window))
#+end_src
** Popup rules

#+begin_src emacs-lisp
(set-popup-rule! "*eww*" :side 'bottom :size .70 :slect t :vslot 5 :ttl 3 :quit nil)
(set-popup-rule! "*Help.*" :side 'right :width .50 :select t :vslot 0 :ttl 3 :quit nil)
(set-popup-rule! "*Man.*" :side 'right :width .50 :select t :slot 1 :ttl 3 :quit 'nil :modeline nil)
(set-popup-rule! "*ansible-doc.*" :side 'bottom :height .40 :select t :vslot 1 :ttl 3 :quit nil)
(set-popup-rule! "*Flycheck errors*" :side 'bottom :height .2 :select nil :quit t)
(after! imenu-list
  (set-popup-rule! "^\\*Ilist"
    :side 'right :size 35 :quit nil :select t :ttl 0))
(set-popup-rule! "*helpful.*" :side 'bottom :height .30 :select t :vslot 0 :ttl 3 :quit 'other)
#+end_src

** Window related enhancements

There are times when I have multiple windows open at the same time, and I constantly want
to switch between the same /two/. ~other-window~ (~C-x o~) will cycle between every window, so
that's not an option.

The ~ch/switch-to-last-window~ function will switch between the two most recently used
windows, which is exactly what I want.

#+begin_src emacs-lisp :tangle "autoload.el"
;;;###autoload
(defun ch/switch-to-last-window ()
  "Switch to the most recently used window."
  (interactive)
  (let ((win (get-mru-window nil t t)))
    (unless win (error "Most recent window not found."))
    (select-window win)))
#+end_src

Let's also create a keybinding for it.

#+begin_src emacs-lisp
(map! "M-o" 'ch/switch-to-last-window)
#+end_src

* Editing configuration

** Buffer formatting

I like having buffers formatted on-save, but not for every mode.

#+begin_src emacs-lisp
(setq +format-on-save-enabled-modes
      '(not tex-mode
            latex-mode
            emacs-lisp-mode
            c-mode
            yaml-mode))
#+end_src

** Indentation

There is this [[https://dougie.io/emacs/indentation/#functions-for-enablingdisabling-tabs][great article]] explaining everything about indentation in Emacs.

#+begin_src emacs-lisp
(setq-default tab-always-indent 'complete ;; Indent first, complete later
              indent-tabs-mode nil        ;; Use spaces for indentation
              tab-width 4)                ;; Use 4 spaces/TAB
#+end_src

*** Identify Spaces and TABs

As per the article, having a way to identify spaces and tabs is important.

#+begin_src emacs-lisp
(setq whitespace-style '(face tabs tab-mark trailing))

(custom-set-faces
 '(whitespace-tab ((t (:foreground "#636363")))))

(setq whitespace-display-mappings
      '((tab-mark 9 [124 9] [92 9])))

(setq whitespace-display-mappings
      ;; all numbers are unicode codepoint in decimal. e.g. (insert-char 182 1)
      '(
        (space-mark 32 [183] [46])    ;; SPACE 32 「 」, 183 MIDDLE DOT 「·」, 46 FULL STOP 「.」
        (newline-mark 10 [182 10])    ;; LINE FEED,
        (tab-mark 9 [9655 9] [92 9])  ;; tab
        ))
#+end_src

*** Untabifying behavior

By default, when deleting a TAB, Emacs will first turn the TAB to many spaces and then
delete one space. I prefer to delete the whole TAB.

#+begin_src emacs-lisp
(setq backward-delete-char-untabify-method 'hungry)
#+end_src

*** Indentation guides

Doom has its own =indent-guides= module, but I only need indentation guides in Python
and YAML files. Instead of removing hooks etc, let's configure it from scratch (well, I
I stole the terminal part from Doom).

#+begin_src emacs-lisp :tangle "packages.el"
(package! highlight-indent-guides :pin "cf352c85cd15dd18aa096ba9d9ab9b7ab493e8f6")
#+end_src

#+begin_src emacs-lisp
(use-package! highlight-indent-guides
  :hook ((python-mode yaml-mode) . highlight-indent-guides-mode)
  :init
  (setq highlight-indent-guides-method 'character)
  :config

  ;; Stolen from Doom Emacs 'indent-guides' module.
  (defun +indent-guides-init-faces-h (&rest _)
    (when (display-graphic-p)
      (highlight-indent-guides-auto-set-faces)))

  ;; HACK `highlight-indent-guides' calculates its faces from the current theme,
  ;;      but is unable to do so properly in terminal Emacs, where it only has
  ;;      access to 256 colors. So if the user uses a daemon we must wait for
  ;;      the first graphical frame to be available to do.
  (add-hook 'doom-load-theme-hook #'+indent-guides-init-faces-h)
  (when doom-init-theme-p
    (+indent-guides-init-faces-h)))
#+end_src

** Associate filetypes with modes

#+begin_src emacs-lisp
(add-to-list 'auto-mode-alist '("\\.cheat\\'" . sh-mode))
(add-to-list 'auto-mode-alist '("\\zshenv" . sh-mode))
#+end_src

* Productivity enhancements

** Syntax checking with flycheck

Having ~flycheck~ enabled in Org buffers provides no benefit, while affecting performance.
Disable it.

Moreover, using =symbols= as the highlighting method makes ~flycheck~ behave like most
modern editors do. Another good option is =lines=, which is (way) faster.

#+begin_src emacs-lisp
(after! flycheck
  (setq flycheck-highlighting-mode 'symbols
        flycheck-global-modes '(not org-mode)))
#+end_src

