config/doom/packages.el

(package! imenu-list)

(package! dired-open)

(package! dired-subtree)

(package! dired-narrow)

(package! peep-dired)

(package! dired-du)

(package! ace-window)

(package! highlight-indent-guides :pin "cf352c85cd15dd18aa096ba9d9ab9b7ab493e8f6")
