config/doom/config.org
** Spell checking

~ispell~ can be configured to use multiple dictionaries at once. I write in both english
and Greek, so this functionality is just perfect.

#+begin_src emacs-lisp
(after! ispell
  (setq ispell-program-name "hunspell"
        ispell-dictionary "en_US,el_GR")
  (ispell-set-spellchecker-params)
  (ispell-hunspell-add-multi-dic "en_US,el_GR"))
#+end_src

Unfortunately, when using the multiple dictionaries functionality, you can't add words to
the built-in dictionaries, so you have to define a "personal" one. While we're here, let's also make sure the
file will be created if it doesn't exist, in case we want to setup Emacs in another machine.

#+begin_src emacs-lisp
(after! ispell
  (setq ispell-personal-dictionary "~/.hunspell_personal")

  (unless (file-exists-p ispell-personal-dictionary)
    (write-region "" nil ispell-personal-dictionary nil 0)))
#+end_src

Finally, spell checking source, example and latex blocks in org-mode has a terrible effect
in performance.

#+begin_src emacs-lisp
(after! ispell
  (add-to-list 'ispell-skip-region-alist '("#\\+BEGIN_SRC" . "#\\+END_SRC"))
  (add-to-list 'ispell-skip-region-alist '("#\\+BEGIN_LATEX" . "#\\+END_LATEX"))
  (add-to-list 'ispell-skip-region-alist '("#\\+BEGIN_EXAMPLE" . "#\\+END_EXAMPLE")))
#+end_src

** Templates (skeletons) with yasnippet

Make yasnippet respect the indentation used in snippets.

#+begin_src emacs-lisp
(after! yasnippet
  (setq yas-indent-line 'fixed
        yas-also-auto-indent-first-line t))
#+end_src

* Tools

** LSP

#+begin_src emacs-lisp
(setq read-process-output-max (* 1024 1024))

(after! lsp
  (setq lsp-completion-provider :capf
        lsp-idle-delay 0.500))

(after! lsp-ui
  (setq lsp-ui-sideline-enable nil
        lsp-ui-doc-enable t
        lsp-ui-doc-header t
        lsp-ui-doc-position 'at-point ;; top, bottom, or at-point
        lsp-ui-doc-delay 0.500
        lsp-ui-peek-enable t
        lsp-ui-peek-fontify 'on-demand)

  (map! :ne "C-S-k" 'lsp-ui-doc-glance))
#+end_src

** pdf-tools

More fine-grained control when zooming.

#+begin_src emacs-lisp
(after! pdf-tools
  (setq pdf-view-resize-factor 1.1))
#+end_src

** Magit

Show a ~diff~ for the current buffer, in a split.

#+begin_src emacs-lisp :tangle "autoload.el"
;;;###autoload
(defun ch/magit-split-and-diff-buffer ()
  (interactive)
  (evil-window-vsplit)
  (magit-diff-buffer-file))
#+end_src

#+begin_src emacs-lisp
(map! (:after magit
       (:leader
        :desc "Git diff buffer"
        "g d" 'ch/magit-split-and-diff-buffer)))
#+end_src

By defaults, diffs in ~magit~ don't have any syntax-highlighting, which is sad. Thankfully,
[[https://github.com/dandavison/magit-delta][magit-delta]] exists.

#+begin_src emacs-lisp :tangle "packages.el"
;; (package! magit-delta :pin "b8526f890415374822514e488341d2b706d6bc2f")
#+end_src

#+begin_src emacs-lisp
;; (add-hook 'magit-mode-hook (lambda () (magit-delta-mode +1)))
#+end_src

#+begin_comment
Unfortunately, the package makes ~magit~ super slow, so it's not an option (yet).
#+end_comment

** authinfo

I have all my information stored in ~authinfo.gpg~, and use the following function to easily
extract them:

#+begin_src emacs-lisp :tangle "autoload.el"
;;;###autoload
(defun ch/find-auth-field (host prop)
  "Search `auth-sources' for HOST entry."
  (let* ((source (auth-source-search :host host))
         (field (plist-get
                 (flatten-list source)
                 prop)))
    (if source
        field
      (user-error "No entry found in auth-sources!"))))
#+end_src

For example, say we have the following entry in ~authinfo.gpg~, which contains a mail
address we don't want to publicly share:

#+begin_example
machine prv login foo@mail.com
#+end_example

We can now retrieve this address using the ~ch/find-auth-field~ function like so:

#+begin_src emacs-lisp :tangle no :eval no
(user-mail-address . ,(ch/find-auth-field "prv" :user))
#+end_src

** Docker

The default Dockerfile template is a bit outdated.

#+begin_src emacs-lisp
(after! dockerfile-mode
  (set-file-template! 'dockerfile-mode
    :trigger "dockerfile-template"))
#+end_src

** Writing systemd files

#+begin_src emacs-lisp :tangle "packages.el"
(package! systemd)
#+end_src

#+begin_src emacs-lisp
(use-package! systemd
  :mode "\\.service|\\.timer|\\.slice")
#+end_src

** Writing Archlinux PKGBUILDs

#+begin_src emacs-lisp :tangle "packages.el"
(package! pkgbuild-mode)
#+end_src

#+begin_src emacs-lisp
(use-package! pkgbuild-mode
  :mode "\\PKGBUILD")
#+end_src

* Applications

** Elfeed (RSS feed reader)

[[https://github.com/skeeto/elfeed][elfeed]] is a feed reader that treats the feeds as a list, which can be narrowed using tags.
[[https://github.com/remyhonig/elfeed-org][elfeed-org]] further enhances this tagging system by providing the ability to manage our
feeds in =org-mode.= This means we can use =org-mode= tags to tag our feeds.

*** Base elfeed configuration

I'm pretty happy with what the package offers by default, but there are a few things I
would like to customize.

#+begin_src emacs-lisp
(after! elfeed
  (setq elfeed-search-filter "@2-week-ago +unread -bugs -reddit"
        elfeed-show-unique-buffers t
        elfeed-search-trailing-width 25
        elfeed-db-directory "~/Documents/Syncthing/elfeed/db/"
        shr-max-image-proportion 0.6)

  (add-hook! 'elfeed-show-mode-hook (hide-mode-line-mode 1)))

(after! elfeed-org
  (setq rmh-elfeed-org-files (list "~/Documents/Syncthing/elfeed/elfeed.org")))
#+end_src

Oh! ~evil-snipe~ is pretty much useless in ~elfeed~, so let's just disable it.
#+begin_src emacs-lisp
(after! evil-snipe
  (push 'elfeed-show-mode   evil-snipe-disabled-modes)
  (push 'elfeed-search-mode evil-snipe-disabled-modes))
#+end_src

What follows is a bunch of functions that extend ~elfeed~'s functionality.

*** Open feeds with eww

#+begin_comment
A lot of the code in the next two sections has been taken from [[https://github.com/wandersoncferreira/dotfiles#rss-feed][wandersoncferreira's]] and
[[https://gitlab.com/protesilaos/dotfiles][Protesilaos']] dotfiles, with small modifications.
#+end_comment

There are some sites who only provide a preview of the article as the feed, and not the
entire article. To actually read the article, the feed must be opened in a browser. This
can be annoying at times, so I would rather open it inside Emacs, using ~eww~. ~eww~ also
has the ability to strip down a site and only show us the "readable" part.

#+begin_src emacs-lisp :tangle "autoload.el"
;;;###autoload
(defun contrib/elfeed-show-eww (&optional link)
  "Browse current `elfeed' entry link in `eww'.
Only show the readable part once the website loads.  This can
fail on poorly-designed websites."
  (interactive)
  (let* ((entry (if (eq major-mode 'elfeed-show-mode)
                    elfeed-show-entry
                  (elfeed-search-selected :ignore-region)))
         (link (if link link (elfeed-entry-link entry))))
    (eww link)
    (delete-other-windows)
    (add-hook 'eww-after-render-hook 'eww-readable nil t)))
#+end_src

*** Handling visual and audio feeds

I also have some feeds that provide visual or audio content (e.g., youtube videos and
podcasts). I would like to either "play" this content~, or download it.
To achieve this, we'll use [[https://github.com/mpv-player/mpv][mpv]] and [[https://github.com/ytdl-org/youtube-dl][youtube-dl]].

#+begin_src emacs-lisp :tangle "autoload.el"
;;;###autoload
(defun ch/elfeed-play-with-mpv ()
  "Play entry link with mpv."
  (interactive)
  (let ((entry (if (eq major-mode 'elfeed-show-mode) elfeed-show-entry (elfeed-search-selected :single)))
        (quality-arg "")
        (quality-val (completing-read "Max height resolution (0 for unlimited): " '("0" "480" "720") nil nil)))
    (setq quality-val (string-to-number quality-val))
    (message "Opening %s with height≤%s with mpv..." (elfeed-entry-link entry) quality-val)
    (when (< 0 quality-val)
      (setq quality-arg (format "--ytdl-format=[height<=?%s]" quality-val)))
    (start-process "elfeed-mpv" nil "mpv" quality-arg (elfeed-entry-link entry))))

;;;###autoload
(defun ch/yt-dl-it (url)
  "Downloads the URL in an async shell"
  (let ((default-directory "~/Downloads/yt-dl"))
    (async-shell-command (format "youtube-dl %s" url))))

;;;###autoload
(defun ch/elfeed-dl (&optional use-generic-p)
  "Download enclosure with youtube-dl."
  (interactive "P")
  (let ((entries (elfeed-search-selected)))
    (cl-loop for entry in entries
             do (elfeed-untag entry 'unread)
             when (elfeed-entry-link entry)
             do (ch/yt-dl-it it))
    (mapc #'elfeed-search-update-entry entries)
    (unless (use-region-p) (forward-line))))
#+end_src

*** Simple "favorites" system

One thing I think would be awesome to have built into ~elfeed~ is a "favorites" system.
Here is a super simple implementation of said system.

First, let's define a new face for our "favorite" (/starred/) entries.

#+begin_src emacs-lisp
(after! elfeed
  (defface elfeed-search-starred-title-face
    '((t :inherit hl-todo))
    "starred entry face."
    :group 'elfeed)

  (push '(star elfeed-search-starred-title-face)
        elfeed-search-face-alist))
#+end_src

Now all we have to do is add the "star" tag to an entry.

#+begin_src emacs-lisp
(map!
 (:after elfeed
  (:map elfeed-search-mode-map
   :after elfeed-search
   (:localleader
    :desc "Toggle star on entry"
    "s" (cmd! (apply 'elfeed-search-toggle-all '(star)))))))
#+end_src

Finally, let's create a function that will present us all the starred entries.

#+begin_src emacs-lisp :tangle "autoload.el"
;;;###autoload
(defun ch/elfeed-show-starred-entries ()
  "Show all time starred entries in elfeed."
  (interactive)
  ;; TODO make this work when called from a mode other than
  ;; elfeed-search-mode.
  (elfeed-search-clear-filter)
  (setq elfeed-search-filter "+star")
  (elfeed-search-update :force))
#+end_src

*** Minor enhancements

#+begin_src emacs-lisp :tangle "autoload.el"
;;;###autoload
(defun ch/elfeed-open ()
  (interactive)
  (elfeed)
  (elfeed-update))

;;;###autoload
(defun contrib/elfeed-kill-buffer-close-window-dwim ()
  "Do-what-I-mean way to handle `elfeed' windows and buffers.

When in an entry buffer, kill the buffer and return to the Elfeed
Search view.  If the entry is in its own window, delete it as
well.

When in the search view, close all other windows.  Else just kill
the buffer."
  (interactive)
  (let ((win (selected-window)))
    (cond ((eq major-mode 'elfeed-show-mode)
           (elfeed-kill-buffer)
           (unless (one-window-p) (delete-window win))
           (switch-to-buffer "*elfeed-search*"))
          ((eq major-mode 'elfeed-search-mode)
           (if (one-window-p)
               (elfeed-search-quit-window)
             (delete-other-windows win))))))

;;;###autoload
(defun contrib/elfeed-search-browse-url (&optional use-generic-p)
  "Visit the current entry in your browser using `browse-url',
without marking the entry as 'read'.
If there is a prefix argument, visit the current entry in the
browser defined by `browse-url-generic-program'."
  (interactive "P")
  (let ((entries (elfeed-search-selected)))
    (cl-loop for entry in entries
             do (elfeed-entry-link entry)
             do (if use-generic-p
                    (browse-url-generic (elfeed-entry-link entry))
                  (browse-url (elfeed-entry-link entry))))
    (mapc #'elfeed-search-update-entry entries)
    (unless (or elfeed-search-remain-on-entry (use-region-p))
      (forward-line))))
#+end_src

*** Keybindings

Finally, let's create some keybindings for the all the stuff above.

#+begin_src emacs-lisp
(map! :leader
      (:prefix ("e" . "External")
       (:when (featurep! :app rss)
        (:prefix ("e" . "Elfeed")
         :desc "Open elfeed" "o" 'ch/elfeed-open))))
(map!
 (:after elfeed
  (:map elfeed-show-mode-map
   :after elfeed-show
   "q" 'nil
   (:localleader
    :desc "Open readable part in eww"
    "e" 'contrib/elfeed-show-eww
    :desc "Play enclosure with mpv"
    "m" 'ch/elfeed-play-with-mpv
    :desc "Kill buffer and close window"
    "q" 'contrib/elfeed-kill-buffer-close-window-dwim
    "y" #'elfeed-show-yank))
  (:map elfeed-search-mode-map
   :after elfeed-search
   "M-RET" 'nil
   :desc "Open entry in browser."
   "M-RET" 'contrib/elfeed-search-browse-url
   (:localleader
    :desc "Fetch feeds"
    "r" 'elfeed-search-fetch
    :desc "Download enclosure with youtube-dl"
    "d" 'ch/elfeed-dl))))
#+end_src

** Treemacs (file explorer)

[[https://github.com/Alexander-Miller/treemacs][treemacs]] is a tree layout file explorer. Admittedly, after discovering how powerful
~dired~ is, I barely (if ever) use this.

For the times I do use it though, let's configure a couple of things.

+ Decrease the ~treemacs~ buffer's width (default value is =35=).
+ In [[*Evil-mode][Evil-mode]], I've set =M-h=, =M-l= etc., to move between windows. This
  won't work in ~treemacs~ unless we create some new bindings for ~evil-treemacs-state~.

#+begin_src emacs-lisp
(after! treemacs
  (setq treemacs-width 30)

  (map! (:after evil
         (:map evil-treemacs-state-map
          "M-h" #'evil-window-left
          "M-l" #'evil-window-right))))
#+end_src

One thing I wish ~treemacs~ had, is an easy way to define a list of files to be ignored,
like ~dired~ does with its ~dired-omit-files~ variable.

The user =tecosaur= has developed a nice [[https://github.com/tecosaur/emacs-config/blob/master/config.org#treemacs][solution]] for this.

#+begin_src emacs-lisp
(after! treemacs
  (defvar treemacs-file-ignore-extensions '()
    "File extension which `treemacs-ignore-filter' will ensure are ignored")
  (defvar treemacs-file-ignore-globs '()
    "Globs which will are transformed to `treemacs-file-ignore-regexps' which `treemacs-ignore-filter' will ensure are ignored")
  (defvar treemacs-file-ignore-regexps '()
    "RegExps to be tested to ignore files, generated from `treeemacs-file-ignore-globs'")
  (defun treemacs-file-ignore-generate-regexps ()
    "Generate `treemacs-file-ignore-regexps' from `treemacs-file-ignore-globs'"
    (setq treemacs-file-ignore-regexps (mapcar 'dired-glob-regexp treemacs-file-ignore-globs)))
  (if (equal treemacs-file-ignore-globs '()) nil (treemacs-file-ignore-generate-regexps))
  (defun treemacs-ignore-filter (file full-path)
    "Ignore files specified by `treemacs-file-ignore-extensions', and `treemacs-file-ignore-regexps'"
    (or (member (file-name-extension file) treemacs-file-ignore-extensions)
        (let ((ignore-file nil))
          (dolist (regexp treemacs-file-ignore-regexps ignore-file)
            (setq ignore-file (or ignore-file (if (string-match-p regexp full-path) t nil)))))))
  (add-to-list 'treemacs-ignored-file-predicates #'treemacs-ignore-filter))
#+end_src

Now we can provide a list of files to be ignored.

#+begin_src emacs-lisp
(after! treemacs
  (setq treemacs-file-ignore-extensions
        '(;; LaTeX
          "aux"
          "ptc"
          "fdb_latexmk"
          "fls"
          "synctex.gz"
          "toc"
          ;; LaTeX - glossary
          "glg"
          "glo"
          "gls"
          "glsdefs"
          "ist"
          "acn"
          "acr"
          "alg"
          ;; LaTeX - pgfplots
          "mw"
          ;; LaTeX - pdfx
          "pdfa.xmpi"
          ))

  (setq treemacs-file-ignore-globs
        '(;; LaTeX
          "*/_minted-*"
          ;; AucTeX
          "*/.auctex-auto"
          "*/_region_.log"
          "*/_region_.tex")))
#+end_src
