config/doom/packages.el

;; (package! magit-delta :pin "b8526f890415374822514e488341d2b706d6bc2f")

(package! systemd)

(package! pkgbuild-mode)
