config/doom/config.org
** Eshell

~eshell~ is a shell written in Emacs Lisp. Since ~eshell~ is a shell, and not a terminal emulator,
it *cannot* run programs that produce a graphical output (e.g., ~htop~). What ~eshell~ offers
that other shells don't, is seamless integration with the rest of Emacs' capabilities.
Moreover, since its written in Elisp, it is heavily extensible.

Doom provides a very nice out of the box configuration for ~eshell~, but as per usual, there
are a couple of things I'd like to change.

*** Base eshell configuration

#+begin_src emacs-lisp
(after! eshell
  (setq eshell-cmpl-ignore-case t
        eshell-glob-case-insensitive t
        eshell-error-if-no-glob t
        eshell-scroll-to-bottom-on-input 'all
        eshell-scroll-to-bottom-on-output 'all
        eshell-kill-processes-on-exit t
        eshell-hist-ignoredups t
        eshell-history-size 10000
        eshell-buffer-maximum-lines 10000
        comint-input-ignoredups t))
#+end_src

*** Eshell enhancements

What got me to try ~eshell~ in the first place, is [[https://www.youtube.com/watch?v=L1f2tulD9N8][this video]] from Protesilaos Stavrou. He
makes a great showcase about ~eshell~ and also describes his own additions, some of which
I've stolen.

+ ~eshell~ lets you easily redirect a command's output to a buffer by using the syntax:
   =>>> #<buffer_name>=. Finding and typing the buffer's name is kinda tedious
   ~contrib/eshell-redirect-to-buffer~ lets you complete the buffer's name a buffer via
   completion.

+ In ~eshell~, you can press =C-c C-r= to go to the first line of the last command's output.
  =C-u C-c C-r= lets you "narrow" the buffer to that output. This can be very handy when
  working with large files like logs. Protesilaos has gone a step further and created
  the ~contrib/eshell-narrow-output-highlight-regexp~ function, that not only narrows the
  buffer to the last command's output, but also asks for a regexp to be highlighted!

+ ~contrib/eshell-complete-history~ lets you pick a command from your history using completion.

+ In ~eshell~, typing =cd == will produce a numbered list of the recent visited directories.
  You can then navigate to a directories by typing =cd -N=, where =N= is the number of the
  directory in the list. This is nice and all, but what if we used completion?
  ~contrib/eshell-complete-recent-dirs~ does just that. Also, if this function iss called
  with the universal argument (=C-u=), the selected directory will be opened in ~dired~.


#+begin_src emacs-lisp :tangle "autoload.el"
;;;###autoload
(defun contrib/eshell-redirect-to-buffer (buffer)
  "Complete the syntax for appending Eshell output to BUFFER."
  (interactive
   (list (read-buffer "Redirect to buffer: ")))
  (insert
   (format " >>> #<%s>" buffer)))

;;;###autoload
(defun contrib/eshell-narrow-output-highlight-regexp (regexp)
  "Narrow to last command output and highlight REGEXP."
  (interactive
   (list (read-regexp "Regexp to highlight")))
  (narrow-to-region (eshell-beginning-of-output)
                    (eshell-end-of-output))
  (goto-char (point-min))
  (highlight-regexp regexp 'hi-yellow)
  (message "Narrowed to last output and highlighted < %s >" regexp))

;;;###autoload
(defun contrib/eshell-complete-history ()
  "Insert element from Eshell history using completion."
  (interactive)
  (let ((hist (ring-elements eshell-history-ring)))
    (insert
     (completing-read "Input from history: " hist nil t))))

(declare-function cl-remove-if-not "cl-seq")

;;;###autoload
(defun contrib/eshell-complete-recent-dir (&optional arg)
  "Switch to a recent Eshell directory using completion.
With optional ARG prefix argument (\\[universal-argument]) also
open the directory in a `dired' buffer."
  (interactive "P")
  (let* ((dirs (ring-elements eshell-last-dir-ring))
         (dir (completing-read "Switch to recent dir: " dirs nil t)))
    (insert dir)
    (eshell-send-input)
    (when arg
      (dired dir))))
#+end_src

*** Keybindings

#+begin_src emacs-lisp
(after! esh-mode
  (map! :map eshell-mode-map
        "C-s" 'isearch-forward
        :ni "M-r" 'contrib/eshell-complete-history
        :ni "C-c C->" 'contrib/eshell-redirect-to-buffer
        :ni "C-c =" 'contrib/eshell-complete-recent-dir
        :ni "C-c h" 'contrib/eshell-narrow-output-highlight-regexp))
#+end_src

* Utilities

** Open external applications in current directory

~vterm~ is great, but sometimes I prefer my actual terminal. Let's create a function
that will open whatever terminal application is set as =$TERMINAL=, in the current
working directory.

While we're here, let's also create a function that will open ~nautilus~ (GNOME's file
manager) in the current working directory.

#+begin_src emacs-lisp :tangle "autoload.el"
;;;###autoload
(defun ch/open-ext-terminal-here ()
  "Open external terminal in current working directory."
  (interactive)
  (let ((process-connection-type nil)
        (terminal (getenv "TERMINAL")))
    (start-process "" nil terminal
                   (cond
                    ((or (equal terminal "tilix") (equal terminal "alacritty"))
                     (concat "--working-directory=" default-directory))
                    ((equal terminal "kitty")
                     (concat "--directory=" default-directory))))))

;;;###autoload
(defun ch/open-nautilus-here ()
  "Open external file manager in current working directory."
  (interactive)
  (let ((process-connection-type nil))
    (start-process "" nil "nautilus" default-directory)))
#+end_src

#+begin_src emacs-lisp
(map! (:leader
       (:prefix ("o" . "+open")
        :desc "Open external terminal here"
        "x" 'ch/open-ext-terminal-here
        :desc "Open external terminal here"
        "n" 'ch/open-nautilus-here)))
#+end_src

** Toggle incognito mode for Firefox

Running this function will /toggle/ the =--private-window= option for Firefox. We can then
call ~browse-url-firefox~ and provide a URL, which will be opened in a private window.
See [[*Custom URL handling][Custom URL handling]] for how this is actually used.

#+begin_src emacs-lisp :tangle "autoload.el" :results silent
;;;###autoload
(defun ch/firefox-incognito ()
  "Toggle incognito mode for link opened with firefox browser."
  (interactive)
  (if (cl-member "--private-window" browse-url-firefox-arguments :test #'string-match)
      (progn
        (setq browse-url-firefox-arguments (cl-remove "--private-window" browse-url-firefox-arguments :test #'equal))
        (message "Turning OFF incognito mode"))
    (progn
      (add-to-list 'browse-url-firefox-arguments "--private-window")
      (message "Turning ON incognito mode"))))
#+end_src

* Org-mode

** System configuration

Org mode isn't recognized as a =mime= type by default, but that's easy to fix.
Creating a file with the following code either in =~/.local/share/mime/packages/org.xml=
(user installation) or =/usr/share/mime/packages/org.xml= (system-wide installation).

#+begin_src conf :tangle no
<?xml version="1.0" encoding="utf-8"?>
<mime-info xmlns='http://www.freedesktop.org/standards/shared-mime-info'>
  <mime-type type="text/org">
    <comment>Emacs Org-mode File</comment>
    <glob pattern="*.org"/>
    <alias type="text/org"/>
  </mime-type>
</mime-info>
#+end_src

Now, let's make Emacs the default application to handle Org files.
#+begin_src shell :eval no :async yes :tangle no
xdg-mime default emacs.desktop text/org
#+end_src

** Functions

#+begin_src emacs-lisp :tangle "autoload.el"
;;;###autoload
(defun ch/org-file-path (filename)
  "Return the absolute address of an org file, given its relative name."
  (concat (file-name-as-directory org-directory) filename))

;;;###autoload
(defun ch/org-search-and-narrow-agenda-headlines ()
  "Jump to an Org headline in `org-agenda-files' and narrow it."
  (interactive)
  (doom-completing-read-org-headings
   "Jump to org headline: " org-agenda-files 3 t)
  (org-narrow-to-subtree))

;;;###autoload
(defun ch/org-search-and-narrow-buffer-headlines ()
  "Goto org headling and narrow it."
  (interactive)
  (counsel-org-goto)
  (org-narrow-to-subtree)
  (org-show-entry))

;;;###autoload
(defun ch/open-link-in-other-window ()
  (interactive)
  (let ((org-link-frame-setup (quote
                               ((vm . vm-visit-folder)
                                (vm-imap . vm-visit-imap-folder)
                                (gnus . gnus)
                                (file . find-file-other-window)
                                (wl . wl)))
                              ))
    (org-open-at-point)))

;;;###autoload
(defun ch/noter-highlight-and-annotate (region)
  "Highlight, annotate and add note of the selected region
using org-noter and pdf-tools"
  (interactive (list (pdf-view-active-region nil)))
  (unless (pdf-view-active-region-p)
    (user-error "A selected region is required!"))
  ;; Highlight selection
  (let ((pdf-annot-activate-created-annotations nil))
    (pdf-annot-add-highlight-markup-annotation region "yellow3"))
  ;; add pdf-noter note
  (org-noter-insert-precise-note))
#+end_src

It is often the case that I mark a task as "DONE" or "CANCELLED", and I forget to archive
it. Let's create a function that will archive all tasks marked as "DONE" or "CANCELLED".

#+begin_src emacs-lisp :tangle "autoload.el" :results silent
;;;###autoload
(defun ch/org-archive-done-tasks ()
  "Archive all 'DONE' tasks and save the buffer"
  (interactive)
  (save-excursion
    (goto-char (point-min))
    (while (re-search-forward "\* \\(DONE\\|CANCELED\\) " nil t)
      (if (save-restriction
            (save-excursion
              (org-narrow-to-subtree)))
          (forward-line)
        (org-archive-subtree)
        (widen)
        (goto-char (line-beginning-position)))))
  (save-buffer))
#+end_src

** Experimental org-mode branch

As you may have experienced, working with large Org files can be a painful experience.
There is [[https://github.com/yantar92/org][this experimental branch]] for org-mode that aims to improve performance in large
files. According to this [[https://www.reddit.com/r/orgmode/comments/k6f5fx/ann_experimental_orgmode_branch_improving/][Reddit thread]], it seems to do a pretty good job.

Let's give it a shot. Both the Reddit thread and the Github repository contain a snippet
to easily install this branch on Doom Emacs.

#+begin_src emacs-lisp :tangle "packages.el"
;; (package! org-mode
;;   :recipe (:host github
;;            :repo "yantar92/org"
;;            :branch "feature/org-fold"
;;            :files ("*.el" "lisp/*.el" "contrib/lisp/*.el")
;;            :build (with-temp-file (expand-file-name "org-version.el" (straight--repos-dir "org"))
;;                     (insert "(fset 'org-release (lambda () \"9.5\"))\n"
;;                             "(fset 'org-git-version #'ignore)\n"
;;                             "(provide 'org-version)\n")))
;;   :pin "ac4874e39e7b2239857410a279e24ae3dcf482ea"
;;   :shadow 'org)
#+end_src

#+begin_comment
While this branch does actually offer an improvement, there are some frustrating bugs with
org-fold and invisible edit. Till those are ironed out, stick to the regular branch.
#+end_comment

** Base org-mode configuration

The locations for the following directories must be specified as early as possible,
otherwise a bunch of errors popup.

#+begin_src emacs-lisp
(setq-default org-directory "~/Documents/Syncthing/Org/")

(setq org-roam-directory "~/Documents/Syncthing/Org/roam/")

(setq org-archive-location
      (concat (ch/org-file-path "archive.org") "::* From %s"))
#+end_src

These are way too many to explain them all, so let Emacs do it's magic (=C-h v=).

#+begin_src emacs-lisp
(after! org
  (setq org-list-allow-alphabetical t
        org-use-property-inheritance t)

  ;; Place a blank line before a new heading or list item.
  org-blank-before-new-entry (quote ((heading) (plain-list-item)))

  (setq org-startup-indented t
        org-startup-with-latex-preview t
        org-startup-with-inline-images nil
        org-startup-folded 'content)

  (setq org-modules '(org-crypt org-habit))

  (setq org-crypt-disable-auto-save t
        org-crypt-key "368B9A157C040EEC885FFFB1DB7099D407ECC1B7")

  (setq org-fontify-whole-heading-line nil
        org-highlight-latex-and-related nil
        org-hide-leading-stars t))
#+end_src

When evaluating/exporting code blocks, I usually prefer the following header-arguments.
Make sure to read the official [[https://orgmode.org/manual/Working-with-Source-Code.html#Working-with-Source-Code][Working with Source Code]] documentation for explanations.

#+begin_src emacs-lisp
(after! org
  (setq org-babel-default-header-args
        '((:session . "none")
          (:results . "output verbatim replace")
          (:exports . "code")
          (:cache . "no")
          (:noweb . "no")
          (:hlines . "no")
          (:tangle . "no")
          (:comments . "no")))
#+end_src

These options can be easily overwritten for a whole file by adding a
=#+PROPERTY: header-args :<option> <value>= in the document's preamble.

#+begin_example
#+PROPERTY: header-args :results silent
#+end_example


*** "TODO" keywords

#+begin_src emacs-lisp
(after! org
  (setq org-todo-keywords
        '((sequence "TODO(t)" "NEXT(n!)" "WIP(w)" "SOMEDAY(s)" "HOLD(h!)" "|" "DONE(d!)" "CANCELLLED(c@/!)")))
  (setq org-todo-keyword-faces
        '(("TODO" :foreground "OrangeRed" :weight bold :underline t :overline t)
          ("NEXT" :foreground "spring green" :weight bold :underline t :overline t)
          ("SOMEDAY" :foreground "coral" :weight bold)
          ("HOLD" :foreground "DeepPink" :weight bold)
          ("WIP" :foreground "DarkCyan" :weight bold)
          ("DONE" :foreground "slategrey" :weight bold :strike-through t)
          ("CANCELLED" :foreground "red2" :weight bold :strike-through t))))
#+end_src

*** Logging and drawers

#+begin_src emacs-lisp
(after! org
  (setq org-log-into-drawer t
        org-log-done 'time
        org-log-repeat 'time
        org-log-redeadline 'note
        org-log-reschedule 'note))
#+end_src

*** Tags

#+begin_src emacs-lisp
(after! org
  (setq org-tag-alist
        '(("@uni"         . ?u)
          ("study"            )
          ("lab"              )
          ("course"           )
          ("assignment"       )
          ("exam"             )
          ("@personal"    . ?p)
          ("health"           )
          ("coding"           )
          ("brainstorming"    )
          ("goal"             )
          ("learn"            )
          ("@read"        . ?r)
          ("@appointment" . ?i)
          ("@project"     . ?P)
          ("@note"        . ?n))))
#+end_src

*** Refiling

Make refile work across all ~agenda-files~.
#+begin_src emacs-lisp
(after! org
  (setq org-refile-targets (quote ((nil :maxlevel . 9)
                                   (org-agenda-files :maxlevel . 9)))
        org-refile-use-outline-path t
        org-outline-path-complete-in-steps t
        org-refile-allow-creating-parent-nodes 'confirm))
#+end_src

