config/doom/packages.el

;; (package! org-mode
;;   :recipe (:host github
;;            :repo "yantar92/org"
;;            :branch "feature/org-fold"
;;            :files ("*.el" "lisp/*.el" "contrib/lisp/*.el")
;;            :build (with-temp-file (expand-file-name "org-version.el" (straight--repos-dir "org"))
;;                     (insert "(fset 'org-release (lambda () \"9.5\"))\n"
;;                             "(fset 'org-git-version #'ignore)\n"
;;                             "(provide 'org-version)\n")))
;;   :pin "ac4874e39e7b2239857410a279e24ae3dcf482ea"
;;   :shadow 'org)
