config/doom/config.org
*** Handling mime types

#+begin_src emacs-lisp
(after! org
  (add-hook 'org-mode-hook
            '(lambda ()
               (setq org-file-apps
                     '((auto-mode . emacs)
                       ("\\.mm\\'"      . default)
                       ("\\.png\\'"     . "eog %s")
                       ("\\.jpg\\'"     . "eog %s")
                       ("\\.jpeg\\'"    . "eog %s")
                       ("\\.mp4\\'"     . "mpv %s")
                       ("\\.x?html?\\'" . firefox))))))
#+end_src

** Look and feel

#+begin_src emacs-lisp
(after! org
  ;; Cooler ellipsis
  (setq org-ellipsis " ▼"
        org-hide-emphasis-markers nil))
#+end_src

*** Fancier Org bullets with org-superstar

[[https://github.com/integral-dw/org-superstar-mode][org-superstar-mode]] makes org-mode heading stars and list items appear nice and modern.
Once again, Doom provides a module for this (=org +pretty=), but it also enables
~org-fancy-priorities~, which I do not want. Instead of disabling packages etc., let's
install ~org-superstar~ from scratch.

#+begin_src emacs-lisp :tangle "packages.el"
(package! org-superstar :pin "7f83636db215bf5a10edbfdf11d12a132864a914")
#+end_src

#+begin_src emacs-lisp
(use-package! org-superstar
  :after org
  :hook (org-mode . org-superstar-mode)
  :init
  :config
  ;; Make leading stars truly invisible, by rendering them as spaces!
  (setq org-superstar-leading-bullet ?\s
        org-superstar-leading-fallback ?\s
        org-superstar-remove-leading-stars nil
        org-superstar-todo-bullet-alist
        '(("TODO" . 9744)
          ("[ ]"  . 9744)
          ("DONE" . 9745)
          ("[X]"  . 9745))))
#+end_src

*** Custom faces for Org headings

I would like headings to be a little bigger, and use a different font that the rest of
the text.

#+begin_src emacs-lisp
(after! org
  (custom-set-faces!
    '(org-document-title :height 1.5))
  (dolist (face '((org-level-1 . 1.2)
                  (org-level-2 . 1.1)
                  (org-level-3 . 1.05)
                  (org-level-4 . 1.0)
                  (org-level-5 . 1.1)
                  (org-level-6 . 1.1)
                  (org-level-7 . 1.1)
                  (org-level-8 . 1.1)))
    (set-face-attribute (car face) nil :font "Hack" :weight 'bold :height (cdr face))))
#+end_src
** Extra functionality

*** org-protocol

[[https://github.com/alphapapa/org-protocol-capture-html][org-protocol-capture-html]] allows us to easily capture HTML from the browser. The package
is not in MELPA, but we can easily install it using =straight recipes=.

#+begin_src emacs-lisp :tangle "packages.el"
(package! org-protocol-capture-html
  :recipe (:host github :repo "alphapapa/org-protocol-capture-html")
  :pin "3359ce9a2f3b48df26329adaee0c4710b1024250")
#+end_src

Now, let's also /register/ org-protocol. The recommended method of doing that is to create
a desktop file.

#+begin_src conf :tangle no
[Desktop Entry]
Name=Org-Protocol
Exec=emacsclient %u
Icon=emacs-icon
Type=Application
Terminal=false
MimeType=x-scheme-handler/org-protocol
#+end_src

Finally, to associate =org-protocol://= links with the above desktop file:

#+begin_src shell :eval no :async yes :tangle no
xdg-mime default org-protocol.desktop x-scheme-handler/org-protocol
#+end_src

*** org-wild-notifier

Notifications for upcoming events.
*TODO*: Try [[https://github.com/legalnonsense/org-timed-alerts][org-timed-alerts.]]

#+begin_src emacs-lisp :tangle "packages.el"
(package! org-wild-notifier)
#+end_src

#+begin_src emacs-lisp
(use-package! org-wild-notifier
  :after org
  :config
  (setq org-wild-notifier-alert-time 15
        org-wild-notifier-keyword-whitelist '("TODO", "WIP")
        alert-default-style 'libnotify)
  (add-hook 'org-mode-hook #'org-wild-notifier-mode))
#+end_src

*** deft

#+begin_src emacs-lisp
(after! deft
  (setq deft-directory "~/Documents/Syncthing/Org/roam/"
        deft-auto-save-interval 0
        deft-recursive t
        deft-current-sort-method 'title
        deft-extensions '("md" "txt" "org")
        deft-use-filename-as-title nil))
#+end_src

*** Custom URL handling

I would also like to re-define the built-in ~+org/dwim-at-point~ and ~org-open-at-point~
functions in a way that, if the /thing at-point/ is a link, it (optionally) uses my
~ch/firefox-incognito~ function we defined in [[*Toggle incognito mode for Firefox][Toggle incognito mode for Firefox]] to open it.
This way, we can call the function with the universal-argument (~C-u~), and the URL will
be opened in an incognito window.

#+begin_src emacs-lisp :tangle "autoload.el" :results silent
;;;###autoload
(defun my-org-open-at-point (&optional arg)
  (interactive "P")
  (if (not arg)
      (org-open-at-point)
    (let ((browse-url-browser-function #'browse-url-firefox))
      (ch/firefox-incognito)
      (org-open-at-point)
      (ch/firefox-incognito))))

;;;###autoload
(defun ch/org-dwim-at-point (&optional arg)
  "Do-what-I-mean at point.

If on a:
- checkbox list item or todo heading: toggle it.
- clock: update its time.
- headline: cycle ARCHIVE subtrees, toggle latex fragments and inline images in
  subtree; update statistics cookies/checkboxes and ToCs.
- footnote reference: jump to the footnote's definition
- footnote definition: jump to the first reference of this footnote
- table-row or a TBLFM: recalculate the table's formulas
- table-cell: clear it and go into insert mode. If this is a formula cell,
  recaluclate it instead.
- babel-call: execute the source block
- statistics-cookie: update it.
- latex fragment: toggle it.
- link: follow it
- otherwise, refresh all inline images in current tree."
  (interactive "P")
  (let* ((context (org-element-context))
         (type (org-element-type context)))
    ;; skip over unimportant contexts
    (while (and context (memq type '(verbatim code bold italic underline strike-through subscript superscript)))
      (setq context (org-element-property :parent context)
            type (org-element-type context)))
    (pcase type
      (`headline
       (cond ((memq (bound-and-true-p org-goto-map)
                    (current-active-maps))
              (org-goto-ret))
             ((and (fboundp 'toc-org-insert-toc)
                   (member "TOC" (org-get-tags)))
              (toc-org-insert-toc)
              (message "Updating table of contents"))
             ((string= "ARCHIVE" (car-safe (org-get-tags)))
              (org-force-cycle-archived))
             ((or (org-element-property :todo-type context)
                  (org-element-property :scheduled context))
              (org-todo
               (if (eq (org-element-property :todo-type context) 'done)
                   (or (car (+org-get-todo-keywords-for (org-element-property :todo-keyword context)))
                       'todo)
                 'done))))
       ;; Update any metadata or inline previews in this subtree
       (org-update-checkbox-count)
       (org-update-parent-todo-statistics)
       (when (and (fboundp 'toc-org-insert-toc)
                  (member "TOC" (org-get-tags)))
         (toc-org-insert-toc)
         (message "Updating table of contents"))
       (let* ((beg (if (org-before-first-heading-p)
                       (line-beginning-position)
                     (save-excursion (org-back-to-heading) (point))))
              (end (if (org-before-first-heading-p)
                       (line-end-position)
                     (save-excursion (org-end-of-subtree) (point))))
              (overlays (ignore-errors (overlays-in beg end)))
              (latex-overlays
               (cl-find-if (lambda (o) (eq (overlay-get o 'org-overlay-type) 'org-latex-overlay))
                           overlays))
              (image-overlays
               (cl-find-if (lambda (o) (overlay-get o 'org-image-overlay))
                           overlays)))
         (+org--toggle-inline-images-in-subtree beg end)
         (if (or image-overlays latex-overlays)
             (org-clear-latex-preview beg end)
           (org--latex-preview-region beg end))))

      (`clock (org-clock-update-time-maybe))

      (`footnote-reference
       (org-footnote-goto-definition (org-element-property :label context)))

      (`footnote-definition
       (org-footnote-goto-previous-reference (org-element-property :label context)))

      ((or `planning `timestamp)
       (org-follow-timestamp-link))

      ((or `table `table-row)
       (if (org-at-TBLFM-p)
           (org-table-calc-current-TBLFM)
         (ignore-errors
           (save-excursion
             (goto-char (org-element-property :contents-begin context))
             (org-call-with-arg 'org-table-recalculate (or arg t))))))

      (`table-cell
       (org-table-blank-field)
       (org-table-recalculate arg)
       (when (and (string-empty-p (string-trim (org-table-get-field)))
                  (bound-and-true-p evil-local-mode))
         (evil-change-state 'insert)))

      (`babel-call
       (org-babel-lob-execute-maybe))

      (`statistics-cookie
       (save-excursion (org-update-statistics-cookies arg)))

      ((or `src-block `inline-src-block)
       (org-babel-execute-src-block arg))

      ((or `latex-fragment `latex-environment)
       (org-latex-preview arg))

      (`link
       (let* ((lineage (org-element-lineage context '(link) t))
              (path (org-element-property :path lineage)))
         (if (or (equal (org-element-property :type lineage) "img")
                 (and path (image-type-from-file-name path)))
             (+org--toggle-inline-images-in-subtree
              (org-element-property :begin lineage)
              (org-element-property :end lineage))
           (my-org-open-at-point arg))))

      ((guard (org-element-property :checkbox (org-element-lineage context '(item) t)))
       (let ((match (and (org-at-item-checkbox-p) (match-string 1))))
         (org-toggle-checkbox (if (equal match "[ ]") '(16)))))

      (_
       (if (or (org-in-regexp org-ts-regexp-both nil t)
               (org-in-regexp org-tsr-regexp-both nil  t)
               (org-in-regexp org-link-any-re nil t))
           (call-interactively #'org-open-at-point)
         (+org--toggle-inline-images-in-subtree
          (org-element-property :begin context)
          (org-element-property :end context)))))))
#+end_src

** Agenda configuration

#+begin_src emacs-lisp
(after! org
  (setq org-agenda-files '("~/Documents/Syncthing/Org/index.org"
                           "~/Documents/Syncthing/Org/bookmarks.org"
                           "~/Documents/Syncthing/Org/projects.org"
                           "~/Documents/Syncthing/Org/roam/")
        org-agenda-dim-blocked-tasks t
        org-agenda-use-time-grid t
        org-agenda-compact-blocks nil
        org-agenda-follow-indirect t
        org-agenda-block-separator 61
        org-agenda-skip-scheduled-if-done t
        org-agenda-skip-deadline-if-done t
        org-enforce-todo-checkbox-dependencies nil
        org-enforce-todo-dependencies t
        org-deadline-warning-days 14
        org-agenda-tag-filter-preset '("-ARCHIVE")
        org-habit-show-habits t
        org-agenda-start-on-weekday 1
        org-agenda-start-day "+0d"
        org-agenda-time-grid
        (quote
         ((require-timed remove-match)
          (0900 2100)
          "      " "┈┈┈┈┈┈┈┈┈┈┈┈┈"))
        ;; Modify the way that deadlines are displayed
        org-agenda-deadline-leaders
        '("Deadline:  " "----- In %3d d.: -----")
        ;; Modify the way that scheduled items are displayed
        ;; org-agenda-scheduled-leaders
        ;; '(">> Scheduled: <<" "** Sched.%2dx: **")
        ))
#+end_src

The default agenda is nice and all, but [[https://github.com/alphapapa/org-super-agenda][org-super-agenda]] provides a much cleaner agenda,
with easily defined groups.

#+begin_src emacs-lisp :tangle "packages.el"
(package! org-super-agenda)
#+end_src

#+begin_src emacs-lisp
(use-package! org-super-agenda
  :after org
  :config
  (map! (:after org
         :map org-super-agenda-header-map
         "j" 'org-agenda-next-line
         "k" 'org-agenda-previous-line)))
#+end_src

*** Super agenda groups

#+begin_src emacs-lisp
(after! org
  (setq org-agenda-custom-commands
        '(("o" "Task Overview"
           ((agenda ""
                    ((org-agenda-span 3)
                     (org-agenda-files '("~/Documents/Syncthing/Org/index.org"
                                         "~/Documents/Syncthing/Org/projects.org"
                                         "~/Documents/Syncthing/Org/roam"))))
            (alltodo ""
                     ((org-agenda-overriding-header "Lens")
                      (org-super-agenda-groups
                       '((:name "Important"
                          :and (:priority "A" :not (:tag "@uni")))
                         (:name "Less important"
                          :and (:not (:priority<= "A" :tag "@uni"))
                          :and (:priority<= "B" :not (:tag "@uni" :todo "SOMEDAY")))
                         (:name "On hold"
                          :todo "HOLD")
                         (:name none
                          :discard (:anything t))))))
            (tags-todo "@uni"
                       ((org-agenda-overriding-header "University")
                        (org-super-agenda-groups
                         '((:name "Exams"
                            :tag "exam")
                           (:name "Labs"
                            :tag "lab")
                           (:name "Courses"
                            :tag "course")
                           (:name "Assignments"
                            :tag "assignment")
                           (:name "What to study"
                            :tag "study")
                           (:discard (:anything t))))))
            (todo "SOMEDAY"
                  ((org-agenda-overriding-header "Maybe, one day..")
                   (org-super-agenda-groups
                    '((:name "Learn stuff"
                       :tag "@read")
                      (:name "What to do.."
                       :anything t)))))
            (tags-todo "@personal"
                       ((org-agenda-overriding-header "Personal")
                        (org-super-agenda-groups
                         '((:name "Appointments"
                            :tag "@appointment")
                           (:discard (:tag "bdays"))))))
            ))
          ("p" "Projects"
           ((todo ""
                  ((org-agenda-overriding-header "Projects")
                   (org-agenda-files '("~/Documents/Syncthing/Org/projects.org"
                                       "~/Documents/Syncthing/Org/roam/Projects/"))
                   (org-super-agenda-groups
                    '((:auto-group t)))))
            ))
          ("r" "Tasks to refile"
           ((tags-todo "REFILE"
                       ((org-agenda-overriding-header "Needs refiling")
                        (org-agenda-files '("~/Documents/Syncthing/Org/refile.org"))
                        (org-super-agenda-groups
                         '((:auto-parent t )))))
            ))
          ))
  (org-super-agenda-mode t)))
#+end_src

