config/doom/packages.el

(package! org-superstar :pin "7f83636db215bf5a10edbfdf11d12a132864a914")

(package! org-protocol-capture-html
  :recipe (:host github :repo "alphapapa/org-protocol-capture-html")
  :pin "3359ce9a2f3b48df26329adaee0c4710b1024250")

(package! org-wild-notifier)

(package! org-super-agenda)
