config/doom/config.org
** Capture templates

~org-capture~ is a great way to quickly capture information.

#+begin_src emacs-lisp
(defvar org-refile-file "~/Documents/Syncthing/Org/refile.org")
(defvar org-tasks-file "~/Documents/Syncthing/Org/index.org")

(after! org
  (setq org-capture-templates
        '(("!" "Quick capture" plain
           (file+headline org-tasks-file "Tasks")
           "** TODO %? \n:PROPERTIES:\n:CREATED: %U\n:END:\n %i\n\n%a"
           :prepend t)

          ("m" "Mail" entry
           (file+headline org-refile-file "Mails")
           "* TODO %(org-insert-time-stamp (org-read-date nil t \"%:date\") nil t) From: %:fromname %a \t")

          ("r" "Reply to an email" entry
           (file+headline org-refile-file "Mail correspondence")
           "* TODO [#B] %:subject :mail:\nSCHEDULED: %t\n:PROPERTIES:\n:CONTEXT: %a\n:END:\n\n%i%?"
           :prepend t)

          ("w" "Web site" entry
           (file+headline org-tasks-file "Websites")
           "* %c \n%U %?%:initial")

          ;; University related templates.
          ("u" "University")
          ;; Capture a test. Asks for schedule.
          ("ut" "Test" entry
           (file+headline org-tasks-file "University")
           "* TODO [#A] %^{Test name} :@uni:exam:\nSCHEDULED:%^{Test date}T\n%i\n%?"
           :prepend t)
          ;; Capture an assignment. Asks for a deadline.
          ("ua" "Assignment" entry
           (file+headline org-tasks-file "University")
           "* TODO [#A] %^{Assignment name} :@uni:assignment:\nDEADLINE:%^{Due date}T\n
              %i\n%?"
           :prepend t)
          ;; Capture a course.
          ("uc" "Course" entry
           (file+headline org-tasks-file "University")
           "* TODO [#B] %^{Course}  :@uni:course:\nSCHEDULED:%^{Course date}T\n%i\n%?"
           :prepend t)

          ;; Will use {project-root}/{todo,notes,changelog}.org, unless a
          ;; {todo,notes,changelog}.org file is found in a parent directory.
          ;; Uses the basename from `+org-capture-todo-file',
          ("p" "Templates for projects")
          ("pt" "Project-local todo" entry  ; {project-root}/todo.org
           (file+headline +org-capture-project-todo-file "Inbox")
           "* TODO %?\n%i\n%a" :prepend t)
          ("pn" "Project-local notes" entry  ; {project-root}/notes.org
           (file+headline +org-capture-project-notes-file "Inbox")
           "* %U %?\n%i\n%a" :prepend t)
          ("pc" "Project-local changelog" entry  ; {project-root}/changelog.org
           (file+headline +org-capture-project-changelog-file "Unreleased")
           "* %U %?\n%i\n%a" :prepend t)

          ;; Will use {org-directory}/{+org-capture-projects-file} and store
          ;; these under {ProjectName}/{Tasks,Notes,Changelog} headings. They
          ;; support `:parents' to specify what headings to put them under, e.g.
          ;; :parents ("Projects")
          ("o" "Centralized templates for projects")
          ("ot" "Project todo" entry
           (function +org-capture-central-project-todo-file)
           "* TODO %?\n %i\n %a"
           :heading "Tasks"
           :prepend nil)
          ("on" "Project notes" entry
           (function +org-capture-central-project-notes-file)
           "* %U %?\n %i\n %a"
           :heading "Notes"
           :prepend t)
          ("oc" "Project changelog" entry
           (function +org-capture-central-project-changelog-file)
           "* %U %?\n %i\n %a"
           :heading "Changelog"
           :prepend t))))
#+end_src

** Roam

#+begin_src emacs-lisp
(after! org-roam
  (add-hook 'org-roam-backlinks-mode-hook #'flyspell-mode-off)
  (setq +org-roam-open-buffer-on-find-file t
        org-roam-tag-sources '(prop all-directories))

  ;; Change the default "daily" org-roam-dailies-capture-template
  ;; so it: includes the name of the day in the filename and the title.
  (setq org-roam-dailies-capture-templates
        '(("d" "daily" plain (function org-roam-capture--get-point) ""
           :immediate-finish t
           :file-name "Dailies/%<%A-%Y-%m-%d>"
           :head "#+TITLE: %<%A %Y-%m-%d>\n#+STARTUP: content\n\n")))

  (setq org-roam-capture-templates
        '(("f" "Fleeting" plain #'org-roam--capture-get-point "%?"
           :file-name "Fleeting/%<%Y%m%d>---${slug}"
           :head "#+title: ${title}\n#+roam_tags:\n\n"
           :unnarrowed t)

          ("d" "Default" plain #'org-roam-capture--get-point "%?"
           :file-name "%<%Y%m%d>---${slug}"
           :head "#+title: ${title}\n#+roam_tags:\n\n"
           :unnarrowed t)

          ("p" "Project" plain #'org-roam-capture--get-point "%?"
           :file-name "Projects/%<%Y%m%d>---${slug}"
           :head "#+title: ${title}\n#+roam_tags:\n\n")))
  )
#+end_src

Below is a set of functions that let us create an org-roam note from an org heading.
The idea/code is taken from https://ag91.github.io/blog/2020/11/12/write-org-roam-notes-via-elisp/.

#+begin_src emacs-lisp :tangle "autoload.el" :results silent
;;;###autoload
(defun contrib/make-filepath (title now &optional zone)
  "Make filename from note TITLE and NOW time (assumed in the current time ZONE)."
  (concat
   org-roam-directory
   (format-time-string "%Y%m%d%H%M%S_" now (or zone (current-time-zone)))
   (org-roam--title-to-slug title)
   ".org"))

;;;###autoload
(defun contrib/insert-org-roam-file (file-path title &optional links sources text quote)
  "Insert org roam file in FILE-PATH with TITLE, LINKS, SOURCES, TEXT, QUOTE."
  (with-temp-file file-path
    (insert
     "#+TITLE: " title "\n"
     "\n"
     "- tags :: " (--reduce (concat acc ", " it) links) "\n"
     (if sources (concat "- source :: " (--reduce (concat acc ", " it) sources) "\n") "")
     "\n"
     (if text text "")
     "\n"
     "\n"
     (if quote
         (concat "#+begin_src text \n"
                 quote "\n"
                 "#+end_src")
       ""))))

;;;###autoload
(defun contrib/convert-task-to-org-note ()
  "Convert a task in a `org-roam' note."
  (interactive)
  (let* ((heading (org-get-heading t t t t))
         (body (org-get-entry))
         (link (format "[[id:%s][%s]]" (org-id-get-create) heading))
         (filepath (contrib/make-filepath heading (current-time))))
    (contrib/insert-org-roam-file
     filepath
     heading
     nil
     (list link)
     (format "* Note stored from tasks\n%s" body)
     nil)
    (find-file filepath)))
#+end_src

#+begin_src emacs-lisp :tangle "packages.el"
;; (package! org-roam-server)
#+end_src

#+begin_src emacs-lisp
(use-package! org-roam-server
  :disabled t
  :after org-roam
  :config
  (setq org-roam-server-host "127.0.0.1"
        org-roam-server-port 8088
        org-roam-server-export-inline-images t
        org-roam-server-authenticate nil
        org-roam-server-network-label-truncate t
        org-roam-server-network-label-truncate-length 60
        org-roam-server-network-label-wrap-length 20
        org-roam-server-network-poll t
        org-roam-server-network-arrows 'from))
#+end_src

** org-export

#+begin_src emacs-lisp
(after! org
  (setq org-export-in-background t
        org-export-headline-levels 5))
#+end_src

*** Exporting to LaTeX

~minted~ (~pygments~) allows us to have beautiful syntax highlighting in LaTeX exports.
~cancel~ is nice to have when writing math equations.

#+begin_src emacs-lisp
(after! org
  (setq org-export-in-background t)
  (add-to-list 'org-latex-packages-alist '("minted" "cancel"))
  (setq org-latex-listings 'minted
        org-latex-minted-options
        '(("mathescape" "true")
          ("linenos" "true")
          ("numbersep" "5pt")
          ("breaklines" "true")
          ("breakanywhere" "true")
          ("tabsize" "4")
          ("frame" "lines")))
  (setq org-latex-pdf-process
        '("xelatex -shell-escape -interaction nonstopmode -output-directory %o %f")))
#+end_src

*** Exporting to HTML

***** Make verbatim and code different

Org provides both ~code~ and =verbatim=, so let's use them!

~code~ seems more appropriate for stuff like commands, e.g., ~(message "Hello")~ while
=verbatim= is more suitable when mentioning keybindings or file system paths, e.g.,
=$DOOMDIR/config.el=.

#+begin_src emacs-lisp
(setq org-html-text-markup-alist
      '((bold . "<b>%s</b>")
        (code . "<code>%s</code>")
        (italic . "<i>%s</i>")
        (strike-through . "<del>%s</del>")
        (underline . "<span class=\"underline\">%s</span>")
        (verbatim . "<kbd>%s</kbd>")))
#+end_src

** Keybindings

#+begin_src emacs-lisp
(map! (:after org
       (:map org-mode-map
        :ne "]i" 'org-next-item
        :ne "[i" 'org-previous-item
        (:localleader
         :desc "Heading to roam note"
         "n" 'contrib/convert-task-to-org-note)
        "C-c C-o" 'ch/open-link-in-other-window)

       (:map pdf-annot-minor-mode-map
        "C-c C-a H" 'ch/noter-highlight-and-annotate)
       (:leader
        (:prefix ("n" . "+notes")
         :desc "Search and narrow agenda headlines"
         "V" 'ch/org-search-and-narrow-agenda-headlines)
        (:prefix ("s" . "+search")
         :desc "Search and narrow buffer headlines"
         "q" 'ch/org-search-and-narrow-buffer-headlines)))

      (:after evil-org
       (:map evil-org-mode-map
        [return] 'nil
        "RET" 'nil
        :n [return] #'ch/org-dwim-at-point
        :n "RET" #'ch/org-dwim-at-point)))
#+end_src

* Prose

** Distraction-free writing with ~olivetti-mode~

~olivetti-mode~ is a simple mode which lets us set a text width to automatically resize
window margins, so that the text is always centered.

#+begin_src emacs-lisp :tangle "packages.el"
(package! olivetti)
#+end_src

#+begin_src emacs-lisp
(use-package! olivetti
  :defer t
  :config
  (setq olivetti-body-width 100
        olivetti-minimum-body-width 80))

(map! (:map text-mode-map
       "<f8>" 'olivetti-mode)
      (:map org-mode-map
       "<f8>" 'olivetti-mode))
#+end_src

** LaTeX

Let's create two functions that will:

1. Save the file and run ~latexmk~ (only usable when the =+latexmk= module is enabled).
2. Save the file and compile it using ~xelatex~.

#+begin_src emacs-lisp :tangle "autoload.el"
;;;###autoload
(defun ch/run-latexmk ()
  "Save the file and and run latexmk"
  (interactive)
  (TeX-save-document (TeX-master-file))
  (TeX-command "LatexMk" #'TeX-master-file -1))

;;;###autoload
(defun ch/latex-save-and-compile ()
  "Save the current buffer and compile it with 'xelatex'"
  (interactive)
  (save-buffer)
  (compile (format "xelatex %s" (file-name-nondirectory buffer-file-name))))
#+end_src

Furthermore, let's make ~xetex~ the default engine, and make sure that when invoking TeX
commands, the file will be automatically saved (super useful when invoking =C-c C-a= to
compile LaTeX source). Also, some keybindings..

#+begin_src emacs-lisp
(setq +latex-viewers '(pdf-tools evince zathura)
      TeX-engine 'xetex
      TeX-command-extra-options "-shell-escape"
      TeX-save-query nil)

(after! latex
  (add-to-list 'TeX-command-list '("XeLaTeX" "%`xelatex%(mode)%' %t" TeX-run-TeX nil t)))

(map! (:after latex
       (:map LaTeX-mode-map
        :ni "C-c s" 'ch/latex-save-and-compile
        :ei [C-return] #'LaTeX-insert-item)))
#+end_src

*** LaTeX and pdf-tools

By default, ~pdf-tools~ will create a buffer with the resulting pdf besides the LaTeX
source. This is fine in most cases, however, sometimes I would like to have the resulting
pdf in a separate frame, maybe in the second monitor.

This can easily be done, of course, but the problem is that when I recompile the LaTeX
source, the side buffer will re-appear. [[https://emacs.stackexchange.com/questions/55395/auctex-and-pdf-tools-in-2-separate-frames-for-dual-monitor-setup][This SO post]] provides a nice workaround.

#+begin_src emacs-lisp :tangle "autoload.el"
;;;###autoload
(defun contrib/display-buffer-use-some-frame (fun &rest args)
  "Use `display-buffer-use-some-frame' as `display-buffer-overriding-action'.
Then run FUN with ARGS."
  (let ((display-buffer-overriding-action '(display-buffer-use-some-frame)))
    (apply fun args)))
#+end_src

#+begin_src emacs-lisp
(after! latex
  ;; Allow `TeX-view' to refresh a PDF in another frame
  (advice-add 'TeX-pdf-tools-sync-view :around #'contrib/display-buffer-use-some-frame)
  (advice-add 'pdf-sync-backward-search-mouse :around #'contrib/display-buffer-use-some-frame))
#+end_src

** Markdown

*** Functions

#+begin_src emacs-lisp :tangle "autoload.el"
;;;###autoload
(defun ch/markdown-save-and-compile ()
  "Save and compiles the currently loaded markdown buffer using pandoc into a PDF"
  (interactive)
  (save-buffer)
  (shell-command (concat "pandoc " (buffer-file-name) " -o "
                         (replace-regexp-in-string "md" "pdf" (buffer-file-name)))))
#+end_src

*** Configuration
* Code

** Rust

#+begin_src emacs-lisp
(after! rustic
  (setq rust-indent-method-chain t
        rustic-lsp-server 'rust-analyzer
        lsp-rust-analyzer-server-command '("/usr/bin/rust-analyzer")
        rustic-cargo-bin "~/.cargo/bin/cargo"
        rustic-format-on-save t))
#+end_src

** Python

#+begin_src emacs-lisp
(after! python
  (setq python-indent-offset 4
        python-shell-interpreter "python3"
        importmagic-python-interpreter "python3"
        flycheck-python-pylint-executable "pylint"
        flycheck-python-flake8-executable "flake8"))
#+end_src

** Ansible

Enable ~ansible-mode~ on every YAML file. Whenever I edit a YAML file, its usually for
Ansible, and if it's not, there is no downside to enabling ~ansible-mode~.

#+begin_src emacs-lisp
(after! yaml-mode
  (add-hook 'yaml-mode-hook #'+ansible-yaml-mode))
#+end_src

Let's also enable =evil-mode= and =visual-line-mode= for =ansible-doc-mode=.

#+begin_src emacs-lisp
(after! ansible-doc
  (when (featurep! :editor evil)
    (add-hook 'ansible-doc-module-mode-hook #'evil-motion-state))
  (add-hook 'ansible-doc-module-mode-hook #'visual-line-mode))
#+end_src

* Misc

** Emacs daemon mode, via systemd

I think managing Emacs server via systemd is much simpler and faster. However, I'd like to
modify the provided systemd service file.

#+begin_src systemd :tangle no
[Unit]
Description=Emacs as a service
Documentation=info:emacs man:emacs(1) https://gnu.org/software/emacs/

[Service]
Type=forking
ExecStart=/usr/bin/emacs --daemon
ExecStop=/usr/bin/emacsclient --no-wait --eval "(progn (setq kill-emacs-hook nil) (kill emacs))"
Restart=on-failure

[Install]
WantedBy=default.target
#+end_src

** Desktop file for emacsclient

If we want to use ~emacsclient~ as a default application for opening files, we have to
create a [[https://wiki.archlinux.org/index.php/Desktop_entries][desktop entry]] for it. Emacs28+ comes with a desktop entry for ~emacsclient~, but
that's not true for previous versions. Let's create one!

#+begin_src conf :tangle no
[Desktop Entry]
Name=Emacs (Client)
GenericName=Text Editor
Comment=A flexible platform for end-user applications
MimeType=text/english;text/plain;text/x-makefile;text/x-c++hdr;text/x-c++src;text/x-chdr;text/x-csrc;text/x-java;text/x-moc;text/x-pascal;text/x-tcl;text/x-tex;application/x-shellscript;text/x-c;text/x-c++;
Exec=emacsclient -create-frame --alternate-editor="" --no-wait %F
Icon=emacs
Type=Application
Terminal=false
Categories=TextEditor;Utility;
StartupWMClass=Emacs
Keywords=Text;Editor;
X-KDE-StartupNotify=false
#+end_src

** Emacs startup

I think sacrificing a little startup time for a smoother first-use experience is preferred.

#+begin_src emacs-lisp
(when (daemonp)
  (run-hooks 'doom-first-input-hook
             'doom-first-buffer-hook
             'doom-first-file-hook))
#+end_src

