config/doom/packages.el

;; (package! org-roam-server)

(package! olivetti)
